Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.1.98/atdf/PIC32MZ2025DAK169.atdf
         <register caption="CAN Baud Rate Configuration Register" name="C2CFG" offset="0x1010" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C2CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C2CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C2CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C2CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C2CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C2CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C2CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C2CFG__WAKFIL" />
         </register>
         <register caption="CAN Interrupt Register" name="C1INT" offset="0x20" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C1INT__TBIF" />
            <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C1INT__RBIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C1INT__CTMRIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C1INT__MODIF" />
            <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C1INT__RBOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C1INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C1INT__CERRIF" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C1INT__WAKIF" />
            <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C1INT__IVRIF" />
            <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C1INT__TBIE" />
            <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C1INT__RBIE" />
            <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C1INT__CTMRIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C1INT__MODIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C1INT__RBOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C1INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C1INT__CERRIE" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C1INT__WAKIE" />
            <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C1INT__IVRIE" />
         </register>
         <register caption="CAN Interrupt Register" name="C2INT" offset="0x1020" rw="RW" size="4">
            <bitfield caption="Transmit Buffer Interrupt Flag bit" mask="0x00000001" name="TBIF" values="C2INT__TBIF" />
            <bitfield caption="Receive Buffer Interrupt Flag bit" mask="0x00000002" name="RBIF" values="C2INT__RBIF" />
            <bitfield caption="CAN Timer Overflow Interrupt Flag bit" mask="0x00000004" name="CTMRIF" values="C2INT__CTMRIF" />
            <bitfield caption="CAN Mode Change Interrupt Flag bit" mask="0x00000008" name="MODIF" values="C2INT__MODIF" />
            <bitfield caption="Receive Buffer Overflow Interrupt Flag bit" mask="0x00000800" name="RBOVIF" values="C2INT__RBOVIF" />
            <bitfield caption="System Error Interrupt Flag bit" mask="0x00001000" name="SERRIF" values="C2INT__SERRIF" />
            <bitfield caption="CAN Bus Error Interrupt Flag bit" mask="0x00002000" name="CERRIF" values="C2INT__CERRIF" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Flag bit" mask="0x00004000" name="WAKIF" values="C2INT__WAKIF" />
            <bitfield caption="Invalid Message Received Interrupt Flag bit" mask="0x00008000" name="IVRIF" values="C2INT__IVRIF" />
            <bitfield caption="Transmit Buffer Interrupt Enable bit" mask="0x00010000" name="TBIE" values="C2INT__TBIE" />
            <bitfield caption="Receive Buffer Interrupt Enable bit" mask="0x00020000" name="RBIE" values="C2INT__RBIE" />
            <bitfield caption="CAN Timestamp Timer Interrupt Enable bit" mask="0x00040000" name="CTMRIE" values="C2INT__CTMRIE" />
            <bitfield caption="Mode Change Interrupt Enable bit" mask="0x00080000" name="MODIE" values="C2INT__MODIE" />
            <bitfield caption="Receive Buffer Overflow Interrupt Enable bit" mask="0x08000000" name="RBOVIE" values="C2INT__RBOVIE" />
            <bitfield caption="System Error Interrupt Enable bit" mask="0x10000000" name="SERRIE" values="C2INT__SERRIE" />
            <bitfield caption="CAN Bus Error Interrupt Enable bit" mask="0x20000000" name="CERRIE" values="C2INT__CERRIE" />
            <bitfield caption="CAN Bus Activity Wake-up Interrupt Enable bit" mask="0x40000000" name="WAKIE" values="C2INT__WAKIE" />
            <bitfield caption="Invalid Message Received Interrupt Enable bit" mask="0x80000000" name="IVRIE" values="C2INT__IVRIE" />
         </register>
         <register caption="CAN Interrupt Code Register" name="C1VEC" offset="0x30" rw="R" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C1VEC__ICODE" />
            <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C1VEC__FILHIT" />
         </register>
         <register caption="CAN Interrupt Code Register" name="C2VEC" offset="0x1030" rw="R" size="4">
            <bitfield caption="Interrupt Flag Code bits" mask="0x0000007F" name="ICODE" values="C2VEC__ICODE" />
            <bitfield caption="Filter Hit Number bit" mask="0x00001F00" name="FILHIT" values="C2VEC__FILHIT" />
         </register>
         <register caption="CAN Transmit/Receive Error Count Register" name="C1TREC" offset="0x40" rw="R" size="4">
            <bitfield mask="0x000000FF" name="RERRCNT" />
            <bitfield mask="0x0000FF00" name="TERRCNT" />
            <bitfield mask="0x00010000" name="EWARN" />
            <bitfield mask="0x00020000" name="RXWARN" />
            <bitfield mask="0x00040000" name="TXWARN" />
            <bitfield mask="0x00080000" name="RXBP" />
            <bitfield mask="0x00100000" name="TXBP" />
            <bitfield mask="0x00200000" name="TXBO" />
         </register>
         <register caption="CAN Transmit/Receive Error Count Register" name="C2TREC" offset="0x1040" rw="R" size="4">
            <bitfield mask="0x000000FF" name="RERRCNT" />
            <bitfield mask="0x0000FF00" name="TERRCNT" />
            <bitfield mask="0x00010000" name="EWARN" />
            <bitfield mask="0x00020000" name="RXWARN" />
            <bitfield mask="0x00040000" name="TXWARN" />
            <bitfield mask="0x00080000" name="RXBP" />
            <bitfield mask="0x00100000" name="TXBP" />
            <bitfield mask="0x00200000" name="TXBO" />
         </register>
         <register caption="CAN FIFO Status Register" name="C1FSTAT" offset="0x50" rw="R" size="4">
            <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C1FSTAT__FIFOIP" />
         </register>
         <register caption="CAN FIFO Status Register" name="C2FSTAT" offset="0x1050" rw="R" size="4">
            <bitfield caption="FIFOx Interrupt Pending bits" mask="0xFFFFFFFF" name="FIFOIP" values="C2FSTAT__FIFOIP" />
         </register>
